---
kind: enumMember
id: F:Autodesk.Revit.DB.BackgroundImageFit.Vertical
enum: Autodesk.Revit.DB.BackgroundImageFit
source: html/7948e97e-d74a-3b6a-e2fd-eb82bfdac7f0.htm
---
# Autodesk.Revit.DB.BackgroundImageFit.Vertical

The image is proportionally resized so its height matches the view's height.